xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/* Utility Functions */
void print_hash( unsigned char hash[] );
void verify_sha256( xi_context_handle_t in_context_handle );


/* Formats topics strings to be used for SFT, subscribes to the service and checks for any pending
 * commit from the previous boot.
 */
int xi_sft_init( xi_context_handle_t in_context_handle, char *account_id, char *device_id )
{
    if( NULL == account_id || NULL == device_id )
    {
        return -1;
    }

    /* xi_stopic is the MQTT topic we PUB to to send messages to the broker. */
    snprintf(xi_stopic, sizeof(xi_stopic),"xi/ctrl/v1/%s/svc", device_id);

    /* xi_ctopic is the MQTT topic we SUBSCRIBE to to receive messages from the broker. */
    snprintf(xi_ctopic, sizeof(xi_ctopic),"xi/ctrl/v1/%s/cln", device_id);

    /* xi_logtopic is the MQTT topic we PUB to to add log messages. */
    snprintf(xi_logtopic, sizeof(xi_logtopic),"xi/blue/v1/%s/d/%s/_log",account_id, device_id);

    /* Accept the latest firmware if we get here. */
    if( sl_extlib_FlcIsPendingCommit() )
    {
        printf("\n********** Committing this revision:\"%s\" **********\n", firmware_revision );
        sl_extlib_FlcCommit( FLC_COMMITED );
//        xi_publish_device_log( in_context_handle, "Firmware Committed",
//                               "Boot loader will now boot to new image", sft_status_ok );
    }

    /* Subscribe to SFT topic.  Everything interesting that happens will occur when an incoming message
     * arrives, handled by a state machine in on_sft_message(). */
    void* user_data = NULL;
    xi_subscribe(in_context_handle, xi_ctopic, XI_MQTT_QOS_AT_MOST_ONCE, on_sft_message, user_data );

    return 0;
}


/* Reboot the device
 * This is invoked through a timed task from the xively client after the
 * file download is complete
 */
static void reboot_mcu( const xi_context_handle_t in_context_handle,
                        const xi_timed_task_handle_t timed_task_handle,
                        void* user_data )
{
  /* Configure hibernate RTC wakeup */
  PRCMHibernateWakeupSourceEnable( PRCM_HIB_SLOW_CLK_CTR );

  /* Delay loop */
  MAP_UtilsDelay( 8000000 );

  /* Set wake up time */
  PRCMHibernateIntervalSet( 330 );

  /* Request hibernate */
  PRCMHibernateEnter();

  /* Control should never reach here */
  while( 1 )
  {
      ;
  }
}





void on_sft_message( xi_context_handle_t in_context_handle,
                            xi_sub_call_type_t call_type,
                            const xi_sub_call_params_t* const params,
                            xi_state_t state,
                            void* user_data )
{
    cn_cbor* cb = NULL;
    cn_cbor* cb_item = NULL;
    const uint8_t* payload_data = NULL;
    size_t payload_length = 0;

    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                printf( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                printf( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                        ( int )params->suback.suback_status );
            }
            return;

        case XI_SUB_CALL_MESSAGE:
            /* get the payload parameter that contains the data that was sent. */
            payload_data = params->message.temporary_payload_data;
            payload_length = params->message.temporary_payload_data_length;

            /* Figure out what the packet type is and then call the appropriate parser */
            cb = cn_cbor_decode( payload_data, payload_length, 0 );

            if (cb)
            {
                cb_item = cn_cbor_mapget_string(cb, "msgtype");
                if( cb_item )
                {
                    switch( cb_item->v.uint )
                    {
                        case XI_FILE_UPDATE_AVAILABLE:
							if( download_ctx.is_downloading )
							{
							    printf("WARNING: ALREADY DOWNLOADING!\n");
							    cn_cbor_free(cb CBOR_CONTEXT_PARAM);
							    break;
							}

                            /* Parse FILE_UPDATE_AVAILABLE messsage
                             * and format GET_FILE_CHUNK message into the outgoing cbor buffer `encoded` */
                            xi_parse_file_update_available( in_context_handle, cb );

                            /* Free the incoming cbor message context */
                            cn_cbor_free(cb CBOR_CONTEXT_PARAM);

                            if( sft_status_ok == download_ctx.result )
                            {
                                /* Open the file for writing */
                                printf("open file length: %d\n", download_ctx.file_length );
                                int open_file_result =  sl_extlib_FlcOpenFile("/sys/mcuimgA.bin", download_ctx.file_length+1024,
                                                                              &download_ctx.file_token, &download_ctx.file_handle,
                                                                              FS_MODE_OPEN_WRITE );
                                /* Check for errors */
                                if( open_file_result < 0 )
                                {
                                    printf(" ERROR: mcuimgA.bin open returned %d\n", open_file_result );
                                    xi_set_sft_error( sft_open_file_error );
//                                    xi_publish_device_log_format_int( in_context_handle, "File update, open failed",
//                                                                      "FlcOpenFile returned: %d",
//                                                                      open_file_result, sft_open_file_error );
                                }
                            }
                            break;

					case XI_FILE_CHUNK:
					        /* Received a file chunk message.  Make sure that we're not in an error state
					         * before processing the message.  */
					        if( sft_status_ok == download_ctx.result )
					        {
	                            /* Parse the FILE_CHUNK message and send another
	                             * FILE_GET_CHUNK request if we're still downloading data */
					            xi_process_file_chunk( in_context_handle, cb );
					        }
					        else
					        {
					            /* we have an error. set download to false.
					             * Note, it might already be false.  This is just for safety. */
					            download_ctx.is_downloading = 0;
					        }

					        /* Free the incoming cbor message context */
							cn_cbor_free(cb CBOR_CONTEXT_PARAM);

							/* Since we're getting file chunks then we were in a downloading state.
							 * If we're not currently downloading, that means the download finished
							 * or we've encountered an error. */
							if( ! download_ctx.is_downloading )
							{
							    if( sft_status_ok == download_ctx.result )
							    {
							        verify_sha256( in_context_handle );
							    }

                                /* Close the firmware file */
                                const int close_files_result = sl_extlib_FlcCloseFile( download_ctx.file_handle, NULL, NULL, 0 );
                                if(  0 != close_files_result )
                                {
                                    printf( "ERROR: firmware file close via FlcCloseFile result: %d\n", close_files_result );
                                    xi_set_sft_error( sft_close_file_error );
//                                    xi_publish_device_log_format_int( in_context_handle, "File update, close failed",
//                                                                      "FlcCloseFile returned: %d",
//                                                                      close_files_result, sft_open_file_error );
                                }

