xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* chunk length */
    cb_item = cn_cbor_mapget_string( in_cb, "L" );
    if( cb_item )
    {
        out_sft_file_chunk->chunk_length = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "L" );
        return;
    }

    /* Status */
    cb_item = cn_cbor_mapget_string( in_cb, "S" );
    if( cb_item )
    {
        out_sft_file_chunk->status = cb_item->v.uint;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "S" );
        return;
    }

    /* Byte Array */
    cb_item = cn_cbor_mapget_string( in_cb, "C" );
    if(cb_item)
    {
        out_sft_file_chunk->array_length = cb_item->length;
        out_sft_file_chunk->byte_array = (unsigned char *)cb_item->v.str;
    }
    else
    {
        xi_missing_cbor_field_error( in_context_handle, "FILE_CHUNK", "C" );
        return;
    }
}


/* Invoked when file download is complete.
 * Converts the locally computed hash into a string
 * and compares it to the SFT hash string 'fingerprint'
 * that we received during the FILE_UPDATE_AVAILABLE message.
 * Reports an error to Device Logs if there's a mis match,
 * and marks the error state.
 */
void verify_sha256( xi_context_handle_t in_context_handle )
{
    /* Finalize SHA256 Digest */
    sha256_final( &download_ctx.sha256_context, download_ctx.file_local_computed_fingerprint );
    printf( "Calculated hash = 0x" );
    print_hash( download_ctx.file_local_computed_fingerprint );

    char local_fingerprint_str[65];
    char* buff_ptr = local_fingerprint_str;

    /* convert binary to a string matching SFT fingprint format */
    int i;
    for( i = 0; i < 32; ++i )
    {
        buff_ptr += sprintf( buff_ptr, "%02x", download_ctx.file_local_computed_fingerprint[i] );
    }

    /* null terminate the string */
    *buff_ptr = '\0';

    /* are they the same? If not then raise the red flag */
    if( 0 != strncmp( local_fingerprint_str, download_ctx.file_sft_fingerprint_str, 64 ) )
    {
        printf("File Update Fingerprint mismatch.  SFT Fingerprint: %s  device-calculated fingerprint: %s\n",
               download_ctx.file_sft_fingerprint_str, local_fingerprint_str );
        xi_set_sft_error( sft_fingerprint_mismatch_error );
//        xi_publish_device_log_format_str_str( in_context_handle, "File Update Fingerprint Mismatch",
//                                              "sft fingerprint: %s device-calculated fingerprint: %s ",
//                                              download_ctx.file_sft_fingerprint_str, local_fingerprint_str,
//                                              sft_fingerprint_mismatch_error );
        return;
    }
}

/*
 * Error Handling functions
 */
void xi_set_sft_error( sft_status_t status )
{
    download_ctx.is_downloading = 0;
    download_ctx.result = status;
}

/*
 * Invoke if a cbor encoded message is missing a required parameter.
 * This will set the error state of the download context, report the error
 * to serial, and report it to the Device Logs service.
 */
void xi_missing_cbor_field_error( xi_context_handle_t in_context_handle,
                                       const char* cbor_message_name, const char* field_name )
{
    xi_set_sft_error( sft_cbor_missing_field_error );

    if( NULL == cbor_message_name || NULL == field_name )
    {
        printf( "ERROR: invalid parameter passed to missing_cbor_field_error\n" );
        return;
    }

    printf("ERROR: SFT Message: %s missing CBOR field: %s\n", cbor_message_name, field_name );

    /* Send to Device Logs */
    char log_details_str[LOGDETAILSSIZE];
    snprintf( log_details_str, sizeof( log_details_str ),
              "SFT Message: %s missing CBOR field: %s", cbor_message_name, field_name );

//    xi_publish_device_log( in_context_handle, "File update available error",
//                        log_details_str, sft_cbor_missing_field_error );
}

/*
 * Device Log Functions
 * Note: Device log entires appear in the 'Logs' tab in Xively CPM's Device Details page of your
 * particular Xively provisioned device.
 */
#if 0
void xi_publish_device_log( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str, const sft_status_t status )
{
    /* Formats a message in the correct Xively Device Logs format and publishes it
     * to the device logs topic. Note that, due to the asynchronous behavior
     * of the client for the platform, this requires a few Xively ticks before
     * sending, so don't reboot immediately following a logged error! */

    if( NULL == message_str || NULL == details_str )
    {
        printf("\nWarning: xi_publish_device_log invoked with a null string parameter\n");
        return;
    }
    else if( sft_status_max <= status )
    {
        printf("\nWarning: xi_publish_device_log invoked with an invalid status parametern");
        return;
    }

    char* severity_str = "";
    switch( status )
    {
    case sft_status_rebooting:
        severity_str = "alert";
        break;
    case sft_status_ok:
        severity_str = "notice";
        break;
    default:
        severity_str = "error";
        break;
    }

    char device_log_buffer[400];
    snprintf( device_log_buffer, sizeof(device_log_buffer),
                  "{\"message\":\"%s\",\"severity\":\"%s\",\"code\":\"%d\",\"details\":\"%s: %s\"}",
                  message_str, severity_str, status, sft_status_strings[ status ], details_str );
    printf( "publishing log: %s\n", device_log_buffer );
    xi_publish( in_context_handle, xi_logtopic, device_log_buffer, XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );

}

void xi_publish_device_log_format_int( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                  const int value_int, const sft_status_t status )
{
    char log_details[LOGDETAILSSIZE];
    strncpy( log_details, details_str, LOGDETAILSSIZE );
    snprintf( log_details, LOGDETAILSSIZE, details_str, value_int );
    xi_publish_device_log( in_context_handle, message_str, log_details, status );
}

